; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	infrared4 - mode
	infrared3 - mode
	thermograph0 - mode
	image5 - mode
	thermograph1 - mode
	thermograph2 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image5)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared4)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared4)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph1)
	(supports instrument6 image5)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(have_image Star5 image5)
	(have_image Planet6 thermograph1)
	(have_image Star7 infrared4)
	(have_image Star7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Planet8 thermograph1)
	(have_image Planet9 thermograph0)
	(have_image Planet9 image5)
	(have_image Star10 infrared3)
	(have_image Planet11 thermograph2)
	(have_image Planet11 thermograph0)
	(have_image Phenomenon12 thermograph2)
))

)

; plan
1. (turn_to satellite2 groundstation2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 12
3. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 12
4. (turn_to satellite2 planet9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet9)
   goals met: 0 of 12
5. (take_image satellite2 planet9 instrument6 image5)
   added: (have_image planet9 image5)
   goals met: 1 of 12
6. (turn_to satellite2 planet6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet6)
   goals met: 1 of 12
7. (turn_to satellite1 groundstation2 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 12
8. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 1 of 12
9. (take_image satellite2 planet6 instrument6 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 2 of 12
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 12
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 12
12. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 12
13. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 2 of 12
14. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 12
15. (take_image satellite0 phenomenon12 instrument2 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 3 of 12
16. (turn_to satellite0 planet11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet11)
   goals met: 3 of 12
17. (take_image satellite0 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 12
18. (turn_to satellite1 planet11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet11)
   goals met: 4 of 12
19. (take_image satellite1 planet11 instrument3 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 5 of 12
20. (turn_to satellite1 planet8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet8)
   goals met: 5 of 12
21. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 6 of 12
22. (take_image satellite1 planet8 instrument3 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 7 of 12
23. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 7 of 12
24. (take_image satellite1 planet9 instrument3 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 8 of 12
25. (turn_to satellite1 star7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star7)
   goals met: 8 of 12
26. (take_image satellite1 star7 instrument3 infrared4)
   added: (have_image star7 infrared4)
   goals met: 9 of 12
27. (take_image satellite1 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 10 of 12
28. (turn_to satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   goals met: 10 of 12
29. (take_image satellite2 star10 instrument6 infrared3)
   added: (have_image star10 infrared3)
   goals met: 11 of 12
30. (turn_to satellite2 star5 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star5)
   goals met: 11 of 12
31. (take_image satellite2 star5 instrument6 image5)
   added: (have_image star5 image5)
   goals met: 12 of 12
